In [1]:
import matplotlib
import matplotlib.font_manager as fm
import matplotlib.pyplot as plt

fontpath = '../bigdata anlysis II/src/NanumBarunGothic.ttf'
font = fm.FontProperties(fname=fontpath, size=9)
plt.rc('font', family='NanumBarunGothic') 
matplotlib.font_manager._rebuild()

Matplotlib is building the font cache; this may take a moment.

# Step1. 탐색: 데이터의 기초 정보 살펴보기

#### * drinks 데이터셋의 기초정보 출력하기

In [2]:
import pandas as pd
file_path = "data/drinks.csv"
drinks = pd.read_csv(file_path, sep ='\t')
print(drinks.info())
drinks.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 1 columns):
 #   Column                                                                                      Non-Null Count  Dtype
---  ------                                                                                      --------------  -----
 0   country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent  193 non-null    object
dtypes: object(1)
memory usage: 1.6+ KB
None

  country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0                           Afghanistan,0,0,0,0.0,AS
1                           Albania,89,132,54,4.9,EU
2                             Algeria,25,0,14,0.7,AF
3                        Andorra,245,138,312,12.4,EU
4                            Angola,217,57,45,5.9,AF

- 책에 주어진 데이터 프레임과 데이터로 현재 데이터프레임이 일치하지 않아  
맞추는 수정작업이 필요하다.

In [3]:
cols = str(drinks.columns[0])
cols = cols.split(',')
cols

['country',
 'beer_servings',
 'spirit_servings',
 'wine_servings',
 'total_litres_of_pure_alcohol',
 'continent']

In [4]:
new_drinks = pd.DataFrame(columns=cols)
for i in range(len(drinks)):
     new_drinks.loc[i] = str(drinks.loc[i][0]).split(",")
new_drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [5]:
# 데이터프레임 생성 후 한 줄씩 추가하는 방법
df4 = pd.DataFrame(columns=("i1", "i2", "i3"))
for i in range(3):
    df4.loc[i] = [(i + 1) * (n + 1) for n in range(3)]
print(df4); print()
    
# 여러 컬럼을 가진 데이터프레임 한 번에 생성하는 방법
df2 = pd.DataFrame({"c1": [1, 2, 3], "c2": [11, 22, 33], "c3": [111, 222, 333]}, index=["i1", "i2", "i3"])
print(df2)

  i1 i2 i3
0  1  2  3
1  2  4  6
2  3  6  9

    c1  c2   c3
i1   1  11  111
i2   2  22  222
i3   3  33  333

In [6]:
drinks = new_drinks
drinks.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    object
 2   spirit_servings               193 non-null    object
 3   wine_servings                 193 non-null    object
 4   total_litres_of_pure_alcohol  193 non-null    object
 5   continent                     193 non-null    object
dtypes: object(6)
memory usage: 10.6+ KB

In [7]:
# Dtype 바꾸기
# beer_servings, spirit_servings, wine_servings -> int64
# total_litres_of_pure_alcohol  -> float64
cols = ['beer_servings', 'spirit_servings', 'wine_servings']
for col in cols:
    drinks = drinks.astype({col: 'int64'})

col = 'total_litres_of_pure_alcohol'
drinks = drinks.astype({col: 'float'})
drinks.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 10.6+ KB

In [8]:
drinks.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

# Step2. 인사이트의 발견: 탐색과 시각화하기

#### * 두 피처간 상관계수 구하기

#### * 여러 피처간 상관계수 분석하기

# Step3. 데이터 전처리: 전처리 함수 사용하기

#### * 결측데이터 전처리하기

#### * 파이차트로 시각화하기

#### * agg() 함수를 이용해 대륙별로 분석하기

#### * 전체 평균보다 많은 알고올을 섭취하는 대륙 구하기

- item_price의 dtype이 float형으로 바뀐 것을 알 수 있다

#### * 평균 beer_servings가 가장 높은 대륙은 어디일까?

# Step4. 탐색적 분석: 스무고개로 개념적 탐색 분석하기

#### * 아프리카와 유럽 간의 맥주 소비량 차이 검정하기

#### * '대한민국은 얼마나 술을 독하게 마시는 나라일까' 탐색하기

#### * 국가별 순위 정보를 시각화하기